aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_pdmpcm.c
cy_rslt_t cyhal_pdm_pcm_init(cyhal_pdm_pcm_t *obj, cyhal_gpio_t pin_data, cyhal_gpio_t pin_clk,
                const cyhal_clock_t *clk_source, const cyhal_pdm_pcm_cfg_t *cfg)
{
    CY_ASSERT(NULL != obj);
    memset(obj, 0, sizeof(cyhal_pdm_pcm_t));
    // On PSoC6, the PDM/PCM block is always driven from HFCLK1.
    CY_UNUSED_PARAMETER(clk_source);

    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->pin_data = CYHAL_NC_PIN_VALUE;
    obj->pin_clk = CYHAL_NC_PIN_VALUE;
    obj->dma.resource.type = CYHAL_RSC_INVALID;

    /* Reserve the PDM-PCM */
    const cyhal_resource_pin_mapping_t *data_map = CY_UTILS_GET_RESOURCE(pin_data, cyhal_pin_map_audioss_pdm_data);
    const cyhal_resource_pin_mapping_t *clk_map = CY_UTILS_GET_RESOURCE(pin_clk, cyhal_pin_map_audioss_pdm_clk);

    if ((NULL == data_map) || (NULL == clk_map) || !cyhal_utils_resources_equal(data_map->inst, clk_map->inst))
    {
        return CYHAL_PDM_PCM_RSLT_ERR_INVALID_PIN;
    }

    obj->resource = *(data_map->inst);
    // There is only one PDM-PCM instance on PSoC6.
    CY_ASSERT(obj->resource.type == CYHAL_RSC_PDM && obj->resource.block_num == 0 && obj->resource.channel_num == 0);
    obj->base = cyhal_pdm_pcm_base[obj->resource.channel_num];

    cy_rslt_t result = cyhal_hwmgr_reserve(&(obj->resource));
    if (result != CY_RSLT_SUCCESS)
    {
        return result;
    }

    /* Reserve the pdm in pin */
    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_utils_reserve_and_connect(pin_data, data_map);
        if (result == CY_RSLT_SUCCESS)
            obj->pin_data = pin_data;
    }

    /* Reserve the clk pin */
    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_utils_reserve_and_connect(pin_clk, clk_map);
        if (result == CY_RSLT_SUCCESS)
            obj->pin_clk = pin_clk;
    }

    if (result == CY_RSLT_SUCCESS)
    {
        cy_stc_pdm_pcm_config_t pdl_struct = default_pdm_pcm_config;
        result = cyhal_pdm_pcm_set_pdl_config_struct(cfg, &pdl_struct);
        if (result == CY_RSLT_SUCCESS)
        {
            result = (cy_rslt_t)Cy_PDM_PCM_Init(obj->base, &pdl_struct);
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        cyhal_pdm_pcm_config_structs[obj->resource.channel_num] = obj;
        obj->word_size = cfg->word_length <= 16 ? 2 : 4;
        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
        obj->irq_cause = CYHAL_PDM_PCM_EVENT_NONE;
        obj->stabilized = false;
        obj->pm_transition_ready = false;

        obj->pm_callback.callback = &cyhal_pdm_pcm_pm_callback,
        obj->pm_callback.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        obj->pm_callback.next = NULL;
        obj->pm_callback.args = (void*)obj;
        obj->pm_callback.ignore_modes = CYHAL_SYSPM_BEFORE_TRANSITION;

        cyhal_syspm_register_peripheral_callback(&(obj->pm_callback));

        cy_stc_sysint_t irqCfg = { cyhal_pdm_pcm_irq_n[obj->resource.channel_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, &cyhal_pdm_pcm_hw_irq_handler);
        NVIC_EnableIRQ(cyhal_pdm_pcm_irq_n[obj->resource.channel_num]);
        cyhal_pdm_pcm_clear(obj);
    }

    if (result != CY_RSLT_SUCCESS)
    {
        cyhal_pdm_pcm_free(obj);
    }
    return result;
}

void cyhal_pdm_pcm_free(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);

    if (CYHAL_RSC_INVALID != obj->resource.type)
    {
        cyhal_syspm_unregister_peripheral_callback(&(obj->pm_callback));
        Cy_PDM_PCM_DeInit(obj->base);
        NVIC_DisableIRQ(cyhal_pdm_pcm_irq_n[obj->resource.channel_num]);

        cyhal_hwmgr_free(&(obj->resource));
        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    cyhal_utils_release_if_used(&(obj->pin_data));
    cyhal_utils_release_if_used(&(obj->pin_clk));

    if (CYHAL_RSC_INVALID != obj->dma.resource.type)
    {
        cyhal_dma_free(&(obj->dma));
    }
}

cy_rslt_t cyhal_pdm_pcm_start(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    obj->stabilized = false;
    // Remove any element currently in the FIFO. This ensure the correct stabilization time delay.
    Cy_PDM_PCM_ClearFifo(obj->base);
    Cy_PDM_PCM_Enable(obj->base);
    // After Enable is asserted, there is a transition period of about 35-45 sample cycles.
    cyhal_pdm_pcm_set_rx_fifo_level(obj, CYHAL_PDM_PCM_STABILIZATION_FS);
    Cy_PDM_PCM_SetInterruptMask(obj->base, Cy_PDM_PCM_GetInterruptMask(obj->base) | CY_PDM_PCM_INTR_RX_TRIGGER);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_stop(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    Cy_PDM_PCM_Disable(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_set_gain(cyhal_pdm_pcm_t *obj, int8_t gain_left, int8_t gain_right)
{
    CY_ASSERT(NULL != obj);
    if (cyhal_pdm_pcm_invalid_gain_range(gain_left) || cyhal_pdm_pcm_invalid_gain_range(gain_right))
    {
        return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }
    Cy_PDM_PCM_SetGain(obj->base, CY_PDM_PCM_CHAN_LEFT, scale_gain_value(gain_left));
    Cy_PDM_PCM_SetGain(obj->base, CY_PDM_PCM_CHAN_RIGHT, scale_gain_value(gain_right));

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_clear(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    Cy_PDM_PCM_ClearFifo(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_read(cyhal_pdm_pcm_t *obj, void *data, size_t *length)
{
    CY_ASSERT(NULL != obj);
    if (!(obj->stabilized))
    {
        *length = 0;
    }
    uint8_t fifo_count = Cy_PDM_PCM_GetNumInFifo(obj->base);
    if (*length > fifo_count)
    {
        *length = fifo_count;
    }
    size_t i;

    if (obj->word_size == 2)
    {
        uint16_t *buffer = (uint16_t *)data;
        for (i = 0; i < *length; i++)
        {
            buffer[i] = (Cy_PDM_PCM_ReadFifo(obj->base) & 0xFFFF);
        }
    }
    else
    {
        uint32_t *buffer = (uint32_t *)data;
        for (i = 0; i < *length; i++)
        {
            buffer[i] = (Cy_PDM_PCM_ReadFifo(obj->base));
        }
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_read_async(cyhal_pdm_pcm_t *obj, void *data, size_t length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    if (cyhal_pdm_pcm_is_pending(obj))
    {
        return CYHAL_PDM_PCM_RSLT_ERR_ASYNC_IN_PROGRESS;
    }

    // Disable PDM interrupts temporarily.
    NVIC_DisableIRQ(cyhal_pdm_pcm_irq_n[obj->resource.channel_num]);

    obj->async_buffer = data;
    obj->async_read_remaining = length;

    cy_rslt_t rslt;
    if (obj->stabilized)
    {
        if (obj->dma.resource.type == CYHAL_RSC_INVALID)
        {
            // read as much as we can, if there are left overs, then set interrupt flags
            cyhal_pdm_pcm_try_read_async(obj);

            if (0 == obj->async_read_remaining)
            {
                cyhal_pdm_pcm_event_callback_t callback = (cyhal_pdm_pcm_event_callback_t) obj->callback_data.callback;
                if (callback != NULL)
                {
                    obj->async_buffer = NULL;
                    callback(obj->callback_data.callback_arg, CYHAL_PDM_PCM_ASYNC_COMPLETE);
                }
            }
            rslt = CY_RSLT_SUCCESS;
        }
        else
        {
            rslt = cyhal_pdm_pcm_dma_start(obj);
        }
    }
    else
    {
        // The block has not stabilized
        rslt = CY_RSLT_SUCCESS;
    }
    // Setup interrupt for FIFO half full.
    if (0 != obj->async_read_remaining)
    {
        Cy_PDM_PCM_SetInterruptMask(obj->base, Cy_PDM_PCM_GetInterruptMask(obj->base) | CY_PDM_PCM_INTR_RX_TRIGGER);
    }
    NVIC_EnableIRQ(cyhal_pdm_pcm_irq_n[obj->resource.channel_num]);
    return rslt;
}

bool cyhal_pdm_pcm_is_pending(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    return obj->async_read_remaining != 0 && obj->async_buffer != NULL;
}

cy_rslt_t cyhal_pdm_pcm_abort_async(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_read_remaining = 0;
    obj->async_buffer = NULL;
    // Only disable the interrupt mask if the user did not explicitly enable the mask
    if (!(obj->irq_cause & CYHAL_PDM_PCM_RX_HALF_FULL))
    {
        Cy_PDM_PCM_SetInterruptMask(obj->base, Cy_PDM_PCM_GetInterruptMask(obj->base) & ~CY_PDM_PCM_INTR_RX_TRIGGER);
    }
    cyhal_system_critical_section_exit(savedIntrStatus);
    return CY_RSLT_SUCCESS;
}

void cyhal_pdm_pcm_register_callback(cyhal_pdm_pcm_t *obj, cyhal_pdm_pcm_event_callback_t callback, void *callback_arg)
{
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

static inline uint32_t cyhal_pdm_pcm_get_pdl_event_mask(cyhal_pdm_pcm_event_t event)
{
    uint32_t mask = 0;
    if (event & CYHAL_PDM_PCM_RX_HALF_FULL)
    {
        mask |= CY_PDM_PCM_INTR_RX_TRIGGER;
    }
    if (event & CYHAL_PDM_PCM_RX_NOT_EMPTY)
    {
        mask |= CY_PDM_PCM_INTR_RX_NOT_EMPTY;
    }
    if (event & CYHAL_PDM_PCM_RX_OVERFLOW)
    {
        mask |= CY_PDM_PCM_INTR_RX_OVERFLOW;
    }
    if (event & CYHAL_PDM_PCM_RX_UNDERFLOW)
    {
        mask |= CY_PDM_PCM_INTR_RX_UNDERFLOW;
    }
    return mask;
}

void cyhal_pdm_pcm_enable_event(cyhal_pdm_pcm_t *obj, cyhal_pdm_pcm_event_t event, uint8_t intr_priority, bool enable)
{
    uint32_t mask = cyhal_pdm_pcm_get_pdl_event_mask(event);
    if (enable)
    {
        obj->irq_cause |= event;
        Cy_PDM_PCM_ClearInterrupt(obj->base, mask);
        Cy_PDM_PCM_SetInterruptMask(obj->base, Cy_PDM_PCM_GetInterruptMask(obj->base) | mask);
    }
    else
    {
        obj->irq_cause &= ~event;
        uint32_t intr_status = cyhal_system_critical_section_enter();
        if (!obj->stabilized && cyhal_pdm_pcm_is_pending(obj))
        {
            // The half full event is used internally by the stabilization code.
            // The start() API clear the FIFO, if we have more data than the half FIFO, then PDM/PCM has stabilized.
            // This half interrupt mask will automatically cleared by the stabilization code.

            // Is an async operation is pending the mask will also be cleared automatically when the async operation finishes
            mask &= ~CY_PDM_PCM_INTR_RX_TRIGGER;
        }
        Cy_PDM_PCM_SetInterruptMask(obj->base, Cy_PDM_PCM_GetInterruptMask(obj->base) & ~mask);
        cyhal_system_critical_section_exit(intr_status);
    }

    NVIC_SetPriority(cyhal_pdm_pcm_irq_n[obj->resource.channel_num], intr_priority);
}

static void cyhal_pdm_pcm_dma_callback(void *callback_arg, cyhal_dma_event_t event)
{
    cyhal_pdm_pcm_t *obj = (cyhal_pdm_pcm_t *)callback_arg;
    if (obj != NULL)
    {
        // DMA finished trigger callback
        cyhal_pdm_pcm_event_callback_t callback = (cyhal_pdm_pcm_event_callback_t) obj->callback_data.callback;
        if (callback != NULL)
        {
            callback(obj->callback_data.callback_arg, CYHAL_PDM_PCM_ASYNC_COMPLETE);
        }
    }
}

cy_rslt_t cyhal_pdm_pcm_set_async_mode(cyhal_pdm_pcm_t *obj, cyhal_async_mode_t mode, uint8_t dma_priority)
{
    CY_ASSERT(NULL != obj);

    if (CYHAL_ASYNC_SW == mode)
    {
        if (CYHAL_DMA_PRIORITY_DEFAULT != dma_priority)
        {
            return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
        }
        if (CYHAL_RSC_INVALID != obj->dma.resource.type)
        {
            cyhal_dma_free(&(obj->dma));
            obj->dma.resource.type = CYHAL_RSC_INVALID;
        }
    }
    else if (CYHAL_ASYNC_DMA == mode && CYHAL_RSC_INVALID == obj->dma.resource.type)
    {
        cy_rslt_t rslt = cyhal_dma_init(&(obj->dma), dma_priority, CYHAL_DMA_DIRECTION_PERIPH2MEM);
        if (CY_RSLT_SUCCESS != rslt)
        {
            return rslt;
        }
        cyhal_dma_register_callback(&(obj->dma), &cyhal_pdm_pcm_dma_callback, obj);
    }
    return CY_RSLT_SUCCESS;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXAUDIOSS_INSTANCES */
